# Homebrew
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "cask"

# System & Tools
brew "mas"
brew "git"
brew "zsh"
brew "curl"
brew "openssl"
brew "gpg"
brew "readline"
brew "coreutils"
brew "direnv"
cask "visual-studio-code"
cask "iterm2"
cask "postman"
cask "docker"

# Languages
brew "asdf"
brew "pnpm"
